
__author__ = 'Арминэ Мороз'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

a = True
a == a**2
print(a)

a = True
a == a*2
print(a)

a = True
a > 999999
print(a)

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?


